###############################################################
#  Generated by:      Cadence Encounter 14.28-s033_1
#  OS:                Linux x86_64(Host ID ws40)
#  Generated on:      Thu Sep 15 16:34:52 2022
#  Design:            BISG_TOP
#  Command:           saveDesign Placement.enc
###############################################################
current_design BISG_TOP
create_clock [get_ports {clk}]  -name clk -period 5.000000 -waveform {0.000000 2.500000}
set_load -pin_load -max  0.06553  [get_ports {nl[3]}]
set_load -pin_load -min  0.06553  [get_ports {nl[3]}]
set_load -pin_load -max  0.06553  [get_ports {nl[2]}]
set_load -pin_load -min  0.06553  [get_ports {nl[2]}]
set_load -pin_load -max  0.06553  [get_ports {nl[1]}]
set_load -pin_load -min  0.06553  [get_ports {nl[1]}]
set_load -pin_load -max  0.06553  [get_ports {nl[0]}]
set_load -pin_load -min  0.06553  [get_ports {nl[0]}]
set_load -pin_load -max  0.06553  [get_ports {nloss}]
set_load -pin_load -min  0.06553  [get_ports {nloss}]
set_load -pin_load -max  0.06553  [get_ports {speaker}]
set_load -pin_load -min  0.06553  [get_ports {speaker}]
set_load -pin_load -max  0.06553  [get_ports {sig[12]}]
set_load -pin_load -min  0.06553  [get_ports {sig[12]}]
set_load -pin_load -max  0.06553  [get_ports {sig[11]}]
set_load -pin_load -min  0.06553  [get_ports {sig[11]}]
set_load -pin_load -max  0.06553  [get_ports {sig[10]}]
set_load -pin_load -min  0.06553  [get_ports {sig[10]}]
set_load -pin_load -max  0.06553  [get_ports {sig[9]}]
set_load -pin_load -min  0.06553  [get_ports {sig[9]}]
set_load -pin_load -max  0.06553  [get_ports {sig[8]}]
set_load -pin_load -min  0.06553  [get_ports {sig[8]}]
set_load -pin_load -max  0.06553  [get_ports {sig[7]}]
set_load -pin_load -min  0.06553  [get_ports {sig[7]}]
set_load -pin_load -max  0.06553  [get_ports {sig[6]}]
set_load -pin_load -min  0.06553  [get_ports {sig[6]}]
set_load -pin_load -max  0.06553  [get_ports {sig[5]}]
set_load -pin_load -min  0.06553  [get_ports {sig[5]}]
set_load -pin_load -max  0.06553  [get_ports {sig[4]}]
set_load -pin_load -min  0.06553  [get_ports {sig[4]}]
set_load -pin_load -max  0.06553  [get_ports {sig[3]}]
set_load -pin_load -min  0.06553  [get_ports {sig[3]}]
set_load -pin_load -max  0.06553  [get_ports {sig[2]}]
set_load -pin_load -min  0.06553  [get_ports {sig[2]}]
set_load -pin_load -max  0.06553  [get_ports {sig[1]}]
set_load -pin_load -min  0.06553  [get_ports {sig[1]}]
set_load -pin_load -max  0.06553  [get_ports {sig[0]}]
set_load -pin_load -min  0.06553  [get_ports {sig[0]}]
set_load -pin_load -max  0.06553  [get_ports {speed[9]}]
set_load -pin_load -min  0.06553  [get_ports {speed[9]}]
set_load -pin_load -max  0.06553  [get_ports {speed[8]}]
set_load -pin_load -min  0.06553  [get_ports {speed[8]}]
set_load -pin_load -max  0.06553  [get_ports {speed[7]}]
set_load -pin_load -min  0.06553  [get_ports {speed[7]}]
set_load -pin_load -max  0.06553  [get_ports {speed[6]}]
set_load -pin_load -min  0.06553  [get_ports {speed[6]}]
set_load -pin_load -max  0.06553  [get_ports {speed[5]}]
set_load -pin_load -min  0.06553  [get_ports {speed[5]}]
set_load -pin_load -max  0.06553  [get_ports {speed[4]}]
set_load -pin_load -min  0.06553  [get_ports {speed[4]}]
set_load -pin_load -max  0.06553  [get_ports {speed[3]}]
set_load -pin_load -min  0.06553  [get_ports {speed[3]}]
set_load -pin_load -max  0.06553  [get_ports {speed[2]}]
set_load -pin_load -min  0.06553  [get_ports {speed[2]}]
set_load -pin_load -max  0.06553  [get_ports {speed[1]}]
set_load -pin_load -min  0.06553  [get_ports {speed[1]}]
set_load -pin_load -max  0.06553  [get_ports {speed[0]}]
set_load -pin_load -min  0.06553  [get_ports {speed[0]}]
set_load -pin_load -max  0.06553  [get_ports {TCK}]
set_load -pin_load -min  0.06553  [get_ports {TCK}]
set_load -pin_load -max  0.06553  [get_ports {scan_done}]
set_load -pin_load -min  0.06553  [get_ports {scan_done}]
set_load -pin_load -max  0.06553  [get_ports {over}]
set_load -pin_load -min  0.06553  [get_ports {over}]
set_load -pin_load -max  0.06553  [get_ports {test_se}]
set_load -pin_load -min  0.06553  [get_ports {test_se}]
set_load -pin_load -max  0.06553  [get_ports {digi_out}]
set_load -pin_load -min  0.06553  [get_ports {digi_out}]
set_load -pin_load -max  0.06553  [get_ports {sub_rst}]
set_load -pin_load -min  0.06553  [get_ports {sub_rst}]
set_dont_touch  [get_cells {b12_0}]
set_dont_touch  [get_cells {b12_0/count_reg_0_}]
set_dont_touch  [get_cells {b12_0/data_in_reg_0_}]
set_dont_touch  [get_cells {b12_0/max_reg_2_}]
set_dont_touch  [get_cells {b12_0/timebase_reg_0_}]
set_dont_touch  [get_cells {b12_0/nloss_reg}]
set_dont_touch  [get_cells {b12_0/speaker_reg}]
set_dont_touch  [get_cells {b12_0/nl_reg_3_}]
set_dont_touch  [get_cells {b12_0/nl_reg_2_}]
set_dont_touch  [get_cells {b12_0/nl_reg_1_}]
set_dont_touch  [get_cells {b12_0/nl_reg_0_}]
set_dont_touch  [get_cells {b12_0/num_reg_0_}]
set_dont_touch  [get_cells {b12_0/num_reg_1_}]
set_dont_touch  [get_cells {b12_0/s_reg}]
set_dont_touch  [get_cells {b12_0/count_reg_1_}]
set_dont_touch  [get_cells {b12_0/timebase_reg_5_}]
set_dont_touch  [get_cells {b12_0/ind_reg_1_}]
set_dont_touch  [get_cells {b12_0/ind_reg_0_}]
set_dont_touch  [get_cells {b12_0/timebase_reg_4_}]
set_dont_touch  [get_cells {b12_0/memory_reg_31__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_31__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_27__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_27__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_15__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_15__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_30__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_30__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_20__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_20__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_11__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_11__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_26__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_26__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_23__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_23__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_21__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_21__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_14__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_14__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_4__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_4__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_10__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_10__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_7__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_7__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_16__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_16__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_22__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_22__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_19__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_19__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_5__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_5__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_17__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_17__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_0__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_0__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_6__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_6__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_3__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_3__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_18__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_18__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_1__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_1__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_2__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_2__0_}]
set_dont_touch  [get_cells {b12_0/play_reg}]
set_dont_touch  [get_cells {b12_0/memory_reg_24__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_24__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_25__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_25__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_28__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_28__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_8__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_8__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_29__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_29__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_9__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_9__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_12__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_12__0_}]
set_dont_touch  [get_cells {b12_0/memory_reg_13__1_}]
set_dont_touch  [get_cells {b12_0/memory_reg_13__0_}]
set_dont_touch  [get_cells {b12_0/address_reg_4_}]
set_dont_touch  [get_cells {b12_0/address_reg_1_}]
set_dont_touch  [get_cells {b12_0/timebase_reg_2_}]
set_dont_touch  [get_cells {b12_0/address_reg_0_}]
set_dont_touch  [get_cells {b12_0/timebase_reg_1_}]
set_dont_touch  [get_cells {b12_0/sound_reg_0_}]
set_dont_touch  [get_cells {b12_0/sound_reg_2_}]
set_dont_touch  [get_cells {b12_0/sound_reg_1_}]
set_dont_touch  [get_cells {b12_0/counter_reg_2_}]
set_dont_touch  [get_cells {b12_0/address_reg_3_}]
set_dont_touch  [get_cells {b12_0/data_out_reg_1_}]
set_dont_touch  [get_cells {b12_0/data_out_reg_0_}]
set_dont_touch  [get_cells {b12_0/counter_reg_1_}]
set_dont_touch  [get_cells {b12_0/counter_reg_0_}]
set_dont_touch  [get_cells {b12_0/address_reg_2_}]
set_dont_touch  [get_cells {b12_0/count_reg2_5_}]
set_dont_touch  [get_cells {b12_0/count_reg2_4_}]
set_dont_touch  [get_cells {b12_0/count_reg2_3_}]
set_dont_touch  [get_cells {b12_0/gamma_reg_2_}]
set_dont_touch  [get_cells {b12_0/gamma_reg_0_}]
set_dont_touch  [get_cells {b12_0/max_reg_4_}]
set_dont_touch  [get_cells {b12_0/scan_reg_3_}]
set_dont_touch  [get_cells {b12_0/scan_reg_1_}]
set_dont_touch  [get_cells {b12_0/scan_reg_0_}]
set_dont_touch  [get_cells {b12_0/max_reg_1_}]
set_dont_touch  [get_cells {b12_0/max_reg_3_}]
set_dont_touch  [get_cells {b12_0/count_reg2_1_}]
set_dont_touch  [get_cells {b12_0/count_reg2_0_}]
set_dont_touch  [get_cells {b12_0/max_reg_0_}]
set_dont_touch  [get_cells {b12_0/gamma_reg_1_}]
set_dont_touch  [get_cells {b12_0/gamma_reg_3_}]
set_dont_touch  [get_cells {b12_0/gamma_reg_4_}]
set_dont_touch  [get_cells {b12_0/data_in_reg_1_}]
set_dont_touch  [get_cells {b12_0/wr_reg}]
set_dont_touch  [get_cells {b12_0/scan_reg_2_}]
set_dont_touch  [get_cells {b12_0/scan_reg_4_}]
set_dont_touch  [get_cells {b12_0/timebase_reg_3_}]
set_dont_touch  [get_cells {b12_0/count_reg2_2_}]
set_dont_touch  [get_cells {b12_0/U520}]
set_dont_touch  [get_cells {b12_0/U521}]
set_dont_touch  [get_cells {b12_0/U522}]
set_dont_touch  [get_cells {b12_0/U523}]
set_dont_touch  [get_cells {b12_0/U524}]
set_dont_touch  [get_cells {b12_0/U525}]
set_dont_touch  [get_cells {b12_0/U526}]
set_dont_touch  [get_cells {b12_0/U527}]
set_dont_touch  [get_cells {b12_0/U528}]
set_dont_touch  [get_cells {b12_0/U529}]
set_dont_touch  [get_cells {b12_0/U530}]
set_dont_touch  [get_cells {b12_0/U531}]
set_dont_touch  [get_cells {b12_0/U532}]
set_dont_touch  [get_cells {b12_0/U533}]
set_dont_touch  [get_cells {b12_0/U534}]
set_dont_touch  [get_cells {b12_0/U535}]
set_dont_touch  [get_cells {b12_0/U536}]
set_dont_touch  [get_cells {b12_0/U537}]
set_dont_touch  [get_cells {b12_0/U538}]
set_dont_touch  [get_cells {b12_0/U539}]
set_dont_touch  [get_cells {b12_0/U540}]
set_dont_touch  [get_cells {b12_0/U541}]
set_dont_touch  [get_cells {b12_0/U542}]
set_dont_touch  [get_cells {b12_0/U543}]
set_dont_touch  [get_cells {b12_0/U544}]
set_dont_touch  [get_cells {b12_0/U545}]
set_dont_touch  [get_cells {b12_0/U546}]
set_dont_touch  [get_cells {b12_0/U547}]
set_dont_touch  [get_cells {b12_0/U548}]
set_dont_touch  [get_cells {b12_0/U549}]
set_dont_touch  [get_cells {b12_0/U550}]
set_dont_touch  [get_cells {b12_0/U551}]
set_dont_touch  [get_cells {b12_0/U552}]
set_dont_touch  [get_cells {b12_0/U553}]
set_dont_touch  [get_cells {b12_0/U554}]
set_dont_touch  [get_cells {b12_0/U555}]
set_dont_touch  [get_cells {b12_0/U556}]
set_dont_touch  [get_cells {b12_0/U557}]
set_dont_touch  [get_cells {b12_0/U558}]
set_dont_touch  [get_cells {b12_0/U559}]
set_dont_touch  [get_cells {b12_0/U560}]
set_dont_touch  [get_cells {b12_0/U561}]
set_dont_touch  [get_cells {b12_0/U562}]
set_dont_touch  [get_cells {b12_0/U563}]
set_dont_touch  [get_cells {b12_0/U564}]
set_dont_touch  [get_cells {b12_0/U565}]
set_dont_touch  [get_cells {b12_0/U566}]
set_dont_touch  [get_cells {b12_0/U567}]
set_dont_touch  [get_cells {b12_0/U568}]
set_dont_touch  [get_cells {b12_0/U569}]
set_dont_touch  [get_cells {b12_0/U570}]
set_dont_touch  [get_cells {b12_0/U571}]
set_dont_touch  [get_cells {b12_0/U572}]
set_dont_touch  [get_cells {b12_0/U573}]
set_dont_touch  [get_cells {b12_0/U574}]
set_dont_touch  [get_cells {b12_0/U575}]
set_dont_touch  [get_cells {b12_0/U576}]
set_dont_touch  [get_cells {b12_0/U577}]
set_dont_touch  [get_cells {b12_0/U578}]
set_dont_touch  [get_cells {b12_0/U579}]
set_dont_touch  [get_cells {b12_0/U580}]
set_dont_touch  [get_cells {b12_0/U581}]
set_dont_touch  [get_cells {b12_0/U582}]
set_dont_touch  [get_cells {b12_0/U583}]
set_dont_touch  [get_cells {b12_0/U584}]
set_dont_touch  [get_cells {b12_0/U585}]
set_dont_touch  [get_cells {b12_0/U586}]
set_dont_touch  [get_cells {b12_0/U587}]
set_dont_touch  [get_cells {b12_0/U588}]
set_dont_touch  [get_cells {b12_0/U589}]
set_dont_touch  [get_cells {b12_0/U590}]
set_dont_touch  [get_cells {b12_0/U591}]
set_dont_touch  [get_cells {b12_0/U592}]
set_dont_touch  [get_cells {b12_0/U593}]
set_dont_touch  [get_cells {b12_0/U594}]
set_dont_touch  [get_cells {b12_0/U595}]
set_dont_touch  [get_cells {b12_0/U596}]
set_dont_touch  [get_cells {b12_0/U597}]
set_dont_touch  [get_cells {b12_0/U598}]
set_dont_touch  [get_cells {b12_0/U599}]
set_dont_touch  [get_cells {b12_0/U600}]
set_dont_touch  [get_cells {b12_0/U601}]
set_dont_touch  [get_cells {b12_0/U602}]
set_dont_touch  [get_cells {b12_0/U603}]
set_dont_touch  [get_cells {b12_0/U604}]
set_dont_touch  [get_cells {b12_0/U605}]
set_dont_touch  [get_cells {b12_0/U606}]
set_dont_touch  [get_cells {b12_0/U607}]
set_dont_touch  [get_cells {b12_0/U608}]
set_dont_touch  [get_cells {b12_0/U609}]
set_dont_touch  [get_cells {b12_0/U610}]
set_dont_touch  [get_cells {b12_0/U611}]
set_dont_touch  [get_cells {b12_0/U612}]
set_dont_touch  [get_cells {b12_0/U613}]
set_dont_touch  [get_cells {b12_0/U614}]
set_dont_touch  [get_cells {b12_0/U615}]
set_dont_touch  [get_cells {b12_0/U616}]
set_dont_touch  [get_cells {b12_0/U617}]
set_dont_touch  [get_cells {b12_0/U618}]
set_dont_touch  [get_cells {b12_0/U619}]
set_dont_touch  [get_cells {b12_0/U620}]
set_dont_touch  [get_cells {b12_0/U621}]
set_dont_touch  [get_cells {b12_0/U622}]
set_dont_touch  [get_cells {b12_0/U623}]
set_dont_touch  [get_cells {b12_0/U624}]
set_dont_touch  [get_cells {b12_0/U625}]
set_dont_touch  [get_cells {b12_0/U626}]
set_dont_touch  [get_cells {b12_0/U627}]
set_dont_touch  [get_cells {b12_0/U628}]
set_dont_touch  [get_cells {b12_0/U629}]
set_dont_touch  [get_cells {b12_0/U630}]
set_dont_touch  [get_cells {b12_0/U631}]
set_dont_touch  [get_cells {b12_0/U632}]
set_dont_touch  [get_cells {b12_0/U633}]
set_dont_touch  [get_cells {b12_0/U634}]
set_dont_touch  [get_cells {b12_0/U635}]
set_dont_touch  [get_cells {b12_0/U636}]
set_dont_touch  [get_cells {b12_0/U637}]
set_dont_touch  [get_cells {b12_0/U638}]
set_dont_touch  [get_cells {b12_0/U639}]
set_dont_touch  [get_cells {b12_0/U640}]
set_dont_touch  [get_cells {b12_0/U641}]
set_dont_touch  [get_cells {b12_0/U642}]
set_dont_touch  [get_cells {b12_0/U643}]
set_dont_touch  [get_cells {b12_0/U644}]
set_dont_touch  [get_cells {b12_0/U645}]
set_dont_touch  [get_cells {b12_0/U646}]
set_dont_touch  [get_cells {b12_0/U647}]
set_dont_touch  [get_cells {b12_0/U648}]
set_dont_touch  [get_cells {b12_0/U649}]
set_dont_touch  [get_cells {b12_0/U650}]
set_dont_touch  [get_cells {b12_0/U651}]
set_dont_touch  [get_cells {b12_0/U652}]
set_dont_touch  [get_cells {b12_0/U653}]
set_dont_touch  [get_cells {b12_0/U654}]
set_dont_touch  [get_cells {b12_0/U655}]
set_dont_touch  [get_cells {b12_0/U656}]
set_dont_touch  [get_cells {b12_0/U657}]
set_dont_touch  [get_cells {b12_0/U658}]
set_dont_touch  [get_cells {b12_0/U659}]
set_dont_touch  [get_cells {b12_0/U660}]
set_dont_touch  [get_cells {b12_0/U661}]
set_dont_touch  [get_cells {b12_0/U662}]
set_dont_touch  [get_cells {b12_0/U663}]
set_dont_touch  [get_cells {b12_0/U664}]
set_dont_touch  [get_cells {b12_0/U665}]
set_dont_touch  [get_cells {b12_0/U666}]
set_dont_touch  [get_cells {b12_0/U667}]
set_dont_touch  [get_cells {b12_0/U668}]
set_dont_touch  [get_cells {b12_0/U669}]
set_dont_touch  [get_cells {b12_0/U670}]
set_dont_touch  [get_cells {b12_0/U671}]
set_dont_touch  [get_cells {b12_0/U672}]
set_dont_touch  [get_cells {b12_0/U673}]
set_dont_touch  [get_cells {b12_0/U674}]
set_dont_touch  [get_cells {b12_0/U675}]
set_dont_touch  [get_cells {b12_0/U676}]
set_dont_touch  [get_cells {b12_0/U677}]
set_dont_touch  [get_cells {b12_0/U678}]
set_dont_touch  [get_cells {b12_0/U679}]
set_dont_touch  [get_cells {b12_0/U680}]
set_dont_touch  [get_cells {b12_0/U681}]
set_dont_touch  [get_cells {b12_0/U682}]
set_dont_touch  [get_cells {b12_0/U683}]
set_dont_touch  [get_cells {b12_0/U684}]
set_dont_touch  [get_cells {b12_0/U685}]
set_dont_touch  [get_cells {b12_0/U686}]
set_dont_touch  [get_cells {b12_0/U687}]
set_dont_touch  [get_cells {b12_0/U688}]
set_dont_touch  [get_cells {b12_0/U689}]
set_dont_touch  [get_cells {b12_0/U690}]
set_dont_touch  [get_cells {b12_0/U691}]
set_dont_touch  [get_cells {b12_0/U692}]
set_dont_touch  [get_cells {b12_0/U693}]
set_dont_touch  [get_cells {b12_0/U694}]
set_dont_touch  [get_cells {b12_0/U695}]
set_dont_touch  [get_cells {b12_0/U696}]
set_dont_touch  [get_cells {b12_0/U697}]
set_dont_touch  [get_cells {b12_0/U698}]
set_dont_touch  [get_cells {b12_0/U699}]
set_dont_touch  [get_cells {b12_0/U700}]
set_dont_touch  [get_cells {b12_0/U701}]
set_dont_touch  [get_cells {b12_0/U702}]
set_dont_touch  [get_cells {b12_0/U703}]
set_dont_touch  [get_cells {b12_0/U704}]
set_dont_touch  [get_cells {b12_0/U705}]
set_dont_touch  [get_cells {b12_0/U706}]
set_dont_touch  [get_cells {b12_0/U707}]
set_dont_touch  [get_cells {b12_0/U708}]
set_dont_touch  [get_cells {b12_0/U709}]
set_dont_touch  [get_cells {b12_0/U710}]
set_dont_touch  [get_cells {b12_0/U711}]
set_dont_touch  [get_cells {b12_0/U712}]
set_dont_touch  [get_cells {b12_0/U713}]
set_dont_touch  [get_cells {b12_0/U714}]
set_dont_touch  [get_cells {b12_0/U715}]
set_dont_touch  [get_cells {b12_0/U716}]
set_dont_touch  [get_cells {b12_0/U717}]
set_dont_touch  [get_cells {b12_0/U718}]
set_dont_touch  [get_cells {b12_0/U719}]
set_dont_touch  [get_cells {b12_0/U720}]
set_dont_touch  [get_cells {b12_0/U721}]
set_dont_touch  [get_cells {b12_0/U722}]
set_dont_touch  [get_cells {b12_0/U723}]
set_dont_touch  [get_cells {b12_0/U724}]
set_dont_touch  [get_cells {b12_0/U725}]
set_dont_touch  [get_cells {b12_0/U726}]
set_dont_touch  [get_cells {b12_0/U727}]
set_dont_touch  [get_cells {b12_0/U728}]
set_dont_touch  [get_cells {b12_0/U729}]
set_dont_touch  [get_cells {b12_0/U730}]
set_dont_touch  [get_cells {b12_0/U731}]
set_dont_touch  [get_cells {b12_0/U732}]
set_dont_touch  [get_cells {b12_0/U733}]
set_dont_touch  [get_cells {b12_0/U734}]
set_dont_touch  [get_cells {b12_0/U735}]
set_dont_touch  [get_cells {b12_0/U736}]
set_dont_touch  [get_cells {b12_0/U737}]
set_dont_touch  [get_cells {b12_0/U738}]
set_dont_touch  [get_cells {b12_0/U739}]
set_dont_touch  [get_cells {b12_0/U740}]
set_dont_touch  [get_cells {b12_0/U741}]
set_dont_touch  [get_cells {b12_0/U742}]
set_dont_touch  [get_cells {b12_0/U743}]
set_dont_touch  [get_cells {b12_0/U744}]
set_dont_touch  [get_cells {b12_0/U745}]
set_dont_touch  [get_cells {b12_0/U746}]
set_dont_touch  [get_cells {b12_0/U747}]
set_dont_touch  [get_cells {b12_0/U748}]
set_dont_touch  [get_cells {b12_0/U749}]
set_dont_touch  [get_cells {b12_0/U750}]
set_dont_touch  [get_cells {b12_0/U751}]
set_dont_touch  [get_cells {b12_0/U752}]
set_dont_touch  [get_cells {b12_0/U753}]
set_dont_touch  [get_cells {b12_0/U754}]
set_dont_touch  [get_cells {b12_0/U755}]
set_dont_touch  [get_cells {b12_0/U756}]
set_dont_touch  [get_cells {b12_0/U757}]
set_dont_touch  [get_cells {b12_0/U758}]
set_dont_touch  [get_cells {b12_0/U759}]
set_dont_touch  [get_cells {b12_0/U760}]
set_dont_touch  [get_cells {b12_0/U761}]
set_dont_touch  [get_cells {b12_0/U762}]
set_dont_touch  [get_cells {b12_0/U763}]
set_dont_touch  [get_cells {b12_0/U764}]
set_dont_touch  [get_cells {b12_0/U765}]
set_dont_touch  [get_cells {b12_0/U766}]
set_dont_touch  [get_cells {b12_0/U767}]
set_dont_touch  [get_cells {b12_0/U768}]
set_dont_touch  [get_cells {b12_0/U769}]
set_dont_touch  [get_cells {b12_0/U770}]
set_dont_touch  [get_cells {b12_0/U771}]
set_dont_touch  [get_cells {b12_0/U772}]
set_dont_touch  [get_cells {b12_0/U773}]
set_dont_touch  [get_cells {b12_0/U774}]
set_dont_touch  [get_cells {b12_0/U775}]
set_dont_touch  [get_cells {b12_0/U776}]
set_dont_touch  [get_cells {b12_0/U777}]
set_dont_touch  [get_cells {b12_0/U778}]
set_dont_touch  [get_cells {b12_0/U779}]
set_dont_touch  [get_cells {b12_0/U780}]
set_dont_touch  [get_cells {b12_0/U781}]
set_dont_touch  [get_cells {b12_0/U782}]
set_dont_touch  [get_cells {b12_0/U783}]
set_dont_touch  [get_cells {b12_0/U784}]
set_dont_touch  [get_cells {b12_0/U785}]
set_dont_touch  [get_cells {b12_0/U786}]
set_dont_touch  [get_cells {b12_0/U787}]
set_dont_touch  [get_cells {b12_0/U788}]
set_dont_touch  [get_cells {b12_0/U789}]
set_dont_touch  [get_cells {b12_0/U790}]
set_dont_touch  [get_cells {b12_0/U791}]
set_dont_touch  [get_cells {b12_0/U792}]
set_dont_touch  [get_cells {b12_0/U793}]
set_dont_touch  [get_cells {b12_0/U794}]
set_dont_touch  [get_cells {b12_0/U795}]
set_dont_touch  [get_cells {b12_0/U796}]
set_dont_touch  [get_cells {b12_0/U797}]
set_dont_touch  [get_cells {b12_0/U798}]
set_dont_touch  [get_cells {b12_0/U799}]
set_dont_touch  [get_cells {b12_0/U800}]
set_dont_touch  [get_cells {b12_0/U801}]
set_dont_touch  [get_cells {b12_0/U802}]
set_dont_touch  [get_cells {b12_0/U803}]
set_dont_touch  [get_cells {b12_0/U804}]
set_dont_touch  [get_cells {b12_0/U805}]
set_dont_touch  [get_cells {b12_0/U806}]
set_dont_touch  [get_cells {b12_0/U807}]
set_dont_touch  [get_cells {b12_0/U808}]
set_dont_touch  [get_cells {b12_0/U809}]
set_dont_touch  [get_cells {b12_0/U810}]
set_dont_touch  [get_cells {b12_0/U811}]
set_dont_touch  [get_cells {b12_0/U812}]
set_dont_touch  [get_cells {b12_0/U813}]
set_dont_touch  [get_cells {b12_0/U814}]
set_dont_touch  [get_cells {b12_0/U815}]
set_dont_touch  [get_cells {b12_0/U816}]
set_dont_touch  [get_cells {b12_0/U817}]
set_dont_touch  [get_cells {b12_0/U818}]
set_dont_touch  [get_cells {b12_0/U819}]
set_dont_touch  [get_cells {b12_0/U820}]
set_dont_touch  [get_cells {b12_0/U821}]
set_dont_touch  [get_cells {b12_0/U822}]
set_dont_touch  [get_cells {b12_0/U823}]
set_dont_touch  [get_cells {b12_0/U824}]
set_dont_touch  [get_cells {b12_0/U825}]
set_dont_touch  [get_cells {b12_0/U826}]
set_dont_touch  [get_cells {b12_0/U827}]
set_dont_touch  [get_cells {b12_0/U828}]
set_dont_touch  [get_cells {b12_0/U829}]
set_dont_touch  [get_cells {b12_0/U830}]
set_dont_touch  [get_cells {b12_0/U831}]
set_dont_touch  [get_cells {b12_0/U832}]
set_dont_touch  [get_cells {b12_0/U833}]
set_dont_touch  [get_cells {b12_0/U834}]
set_dont_touch  [get_cells {b12_0/U835}]
set_dont_touch  [get_cells {b12_0/U836}]
set_dont_touch  [get_cells {b12_0/U837}]
set_dont_touch  [get_cells {b12_0/U838}]
set_dont_touch  [get_cells {b12_0/U839}]
set_dont_touch  [get_cells {b12_0/U840}]
set_dont_touch  [get_cells {b12_0/U841}]
set_dont_touch  [get_cells {b12_0/U842}]
set_dont_touch  [get_cells {b12_0/U843}]
set_dont_touch  [get_cells {b12_0/U844}]
set_dont_touch  [get_cells {b12_0/U845}]
set_dont_touch  [get_cells {b12_0/U846}]
set_dont_touch  [get_cells {b12_0/U847}]
set_dont_touch  [get_cells {b12_0/U848}]
set_dont_touch  [get_cells {b12_0/U849}]
set_dont_touch  [get_cells {b12_0/U850}]
set_dont_touch  [get_cells {b12_0/U851}]
set_dont_touch  [get_cells {b12_0/U852}]
set_dont_touch  [get_cells {b12_0/U853}]
set_dont_touch  [get_cells {b12_0/U854}]
set_dont_touch  [get_cells {b12_0/U855}]
set_dont_touch  [get_cells {b12_0/U856}]
set_dont_touch  [get_cells {b12_0/U857}]
set_dont_touch  [get_cells {b12_0/U858}]
set_dont_touch  [get_cells {b12_0/U859}]
set_dont_touch  [get_cells {b12_0/U860}]
set_dont_touch  [get_cells {b12_0/U861}]
set_dont_touch  [get_cells {b12_0/U862}]
set_dont_touch  [get_cells {b12_0/U863}]
set_dont_touch  [get_cells {b12_0/U864}]
set_dont_touch  [get_cells {b12_0/U865}]
set_dont_touch  [get_cells {b12_0/U866}]
set_dont_touch  [get_cells {b12_0/U867}]
set_dont_touch  [get_cells {b12_0/U868}]
set_dont_touch  [get_cells {b12_0/U869}]
set_dont_touch  [get_cells {b12_0/U870}]
set_dont_touch  [get_cells {b12_0/U871}]
set_dont_touch  [get_cells {b12_0/U872}]
set_dont_touch  [get_cells {b12_0/U873}]
set_dont_touch  [get_cells {b12_0/U874}]
set_dont_touch  [get_cells {b12_0/U875}]
set_dont_touch  [get_cells {b12_0/U876}]
set_dont_touch  [get_cells {b12_0/U877}]
set_dont_touch  [get_cells {b12_0/U878}]
set_dont_touch  [get_cells {b12_0/U879}]
set_dont_touch  [get_cells {b12_0/U880}]
set_dont_touch  [get_cells {b12_0/U881}]
set_dont_touch  [get_cells {b12_0/U882}]
set_dont_touch  [get_cells {b12_0/U883}]
set_dont_touch  [get_cells {b12_0/U884}]
set_dont_touch  [get_cells {b12_0/U885}]
set_dont_touch  [get_cells {b12_0/U886}]
set_dont_touch  [get_cells {b12_0/U887}]
set_dont_touch  [get_cells {b12_0/U888}]
set_dont_touch  [get_cells {b12_0/U889}]
set_dont_touch  [get_cells {b12_0/U890}]
set_dont_touch  [get_cells {b12_0/U891}]
set_dont_touch  [get_cells {b12_0/U892}]
set_dont_touch  [get_cells {b12_0/U893}]
set_dont_touch  [get_cells {b12_0/U894}]
set_dont_touch  [get_cells {b12_0/U895}]
set_dont_touch  [get_cells {b12_0/U896}]
set_dont_touch  [get_cells {b12_0/U897}]
set_dont_touch  [get_cells {b12_0/U898}]
set_dont_touch  [get_cells {b12_0/U899}]
set_dont_touch  [get_cells {b12_0/U900}]
set_dont_touch  [get_cells {b12_0/U901}]
set_dont_touch  [get_cells {b12_0/U902}]
set_dont_touch  [get_cells {b12_0/U903}]
set_dont_touch  [get_cells {b12_0/U904}]
set_dont_touch  [get_cells {b12_0/U905}]
set_dont_touch  [get_cells {b12_0/U906}]
set_dont_touch  [get_cells {b12_0/U907}]
set_dont_touch  [get_cells {b12_0/U908}]
set_dont_touch  [get_cells {b12_0/U909}]
set_dont_touch  [get_cells {b12_0/U910}]
set_dont_touch  [get_cells {b12_0/U911}]
set_dont_touch  [get_cells {b12_0/U912}]
set_dont_touch  [get_cells {b12_0/U913}]
set_dont_touch  [get_cells {b12_0/U914}]
set_dont_touch  [get_cells {b12_0/U915}]
set_dont_touch  [get_cells {b12_0/U916}]
set_dont_touch  [get_cells {b12_0/U917}]
set_dont_touch  [get_cells {b12_0/U918}]
set_dont_touch  [get_cells {b12_0/U919}]
set_dont_touch  [get_cells {b12_0/U920}]
set_dont_touch  [get_cells {b12_0/U921}]
set_dont_touch  [get_cells {b12_0/U922}]
set_dont_touch  [get_cells {b12_0/U923}]
set_dont_touch  [get_cells {b12_0/U924}]
set_dont_touch  [get_cells {b12_0/U925}]
set_dont_touch  [get_cells {b12_0/U926}]
set_dont_touch  [get_cells {b12_0/U927}]
set_dont_touch  [get_cells {b12_0/U928}]
set_dont_touch  [get_cells {b12_0/U929}]
set_dont_touch  [get_cells {b12_0/U930}]
set_dont_touch  [get_cells {b12_0/U931}]
set_dont_touch  [get_cells {b12_0/U932}]
set_dont_touch  [get_cells {b12_0/U933}]
set_dont_touch  [get_cells {b12_0/U934}]
set_dont_touch  [get_cells {b12_0/U935}]
set_dont_touch  [get_cells {b12_0/U936}]
set_dont_touch  [get_cells {b12_0/U937}]
set_dont_touch  [get_cells {b12_0/U938}]
set_dont_touch  [get_cells {b12_0/U939}]
set_dont_touch  [get_cells {b12_0/U940}]
set_dont_touch  [get_cells {b12_0/U941}]
set_dont_touch  [get_cells {b12_0/U942}]
set_dont_touch  [get_cells {b12_0/U943}]
set_dont_touch  [get_cells {b12_0/U944}]
set_dont_touch  [get_cells {b12_0/U945}]
set_dont_touch  [get_cells {b12_0/U946}]
set_dont_touch  [get_cells {b12_0/U947}]
set_dont_touch  [get_cells {b12_0/U948}]
set_dont_touch  [get_cells {b12_0/U949}]
set_dont_touch  [get_cells {b12_0/U950}]
set_dont_touch  [get_cells {b12_0/U951}]
set_dont_touch  [get_cells {b12_0/U952}]
set_dont_touch  [get_cells {b12_0/U953}]
set_dont_touch  [get_cells {b12_0/U954}]
set_dont_touch  [get_cells {b12_0/U955}]
set_dont_touch  [get_cells {b12_0/U956}]
set_dont_touch  [get_cells {b12_0/U957}]
set_dont_touch  [get_cells {b12_0/U958}]
set_dont_touch  [get_cells {b12_0/U959}]
set_dont_touch  [get_cells {b12_0/U960}]
set_dont_touch  [get_cells {b12_0/U961}]
set_dont_touch  [get_cells {b12_0/U962}]
set_dont_touch  [get_cells {b12_0/U963}]
set_dont_touch  [get_cells {b12_0/U964}]
set_dont_touch  [get_cells {b12_0/U965}]
set_dont_touch  [get_cells {b12_0/U966}]
set_dont_touch  [get_cells {b12_0/U967}]
set_dont_touch  [get_cells {b12_0/U968}]
set_dont_touch  [get_cells {b12_0/U969}]
set_dont_touch  [get_cells {b12_0/U970}]
set_dont_touch  [get_cells {b12_0/U971}]
set_dont_touch  [get_cells {b12_0/U972}]
set_dont_touch  [get_cells {b12_0/U973}]
set_dont_touch  [get_cells {b12_0/U974}]
set_dont_touch  [get_cells {b12_0/U975}]
set_dont_touch  [get_cells {b12_0/U976}]
set_dont_touch  [get_cells {b12_0/U977}]
set_dont_touch  [get_cells {b12_0/U978}]
set_dont_touch  [get_cells {b12_0/U979}]
set_dont_touch  [get_cells {b12_0/U980}]
set_dont_touch  [get_cells {b12_0/U981}]
set_dont_touch  [get_cells {b12_0/U982}]
set_dont_touch  [get_cells {b12_0/U983}]
set_dont_touch  [get_cells {b12_0/U984}]
set_dont_touch  [get_cells {b12_0/U985}]
set_dont_touch  [get_cells {b12_0/U986}]
set_dont_touch  [get_cells {b12_0/U987}]
set_dont_touch  [get_cells {b12_0/U988}]
set_dont_touch  [get_cells {b12_0/U989}]
set_dont_touch  [get_cells {b12_0/U990}]
set_dont_touch  [get_cells {b12_0/U991}]
set_dont_touch  [get_cells {b12_0/U992}]
set_dont_touch  [get_cells {b12_0/U993}]
set_dont_touch  [get_cells {b12_0/U994}]
set_dont_touch  [get_cells {b12_0/U995}]
set_dont_touch  [get_cells {b12_0/U996}]
set_dont_touch  [get_cells {b12_0/U997}]
set_dont_touch  [get_cells {b12_0/U998}]
set_dont_touch  [get_cells {b12_0/U999}]
set_dont_touch  [get_cells {b12_0/U1000}]
set_dont_touch  [get_cells {b12_0/U1001}]
set_dont_touch  [get_cells {b12_0/U1002}]
set_dont_touch  [get_cells {b12_0/U1003}]
set_dont_touch  [get_cells {b12_0/U1004}]
set_dont_touch  [get_cells {b12_0/U1005}]
set_dont_touch  [get_cells {b12_0/U1006}]
set_dont_touch  [get_cells {b12_0/U1007}]
set_dont_touch  [get_cells {b12_0/U1008}]
set_dont_touch  [get_cells {b12_0/U1009}]
set_dont_touch  [get_cells {b12_0/U1010}]
set_dont_touch  [get_cells {b12_0/U1011}]
set_dont_touch  [get_cells {b12_0/U1012}]
set_dont_touch  [get_cells {b12_0/U1013}]
set_dont_touch  [get_cells {b12_0/U1014}]
set_dont_touch  [get_cells {b12_0/U1015}]
set_dont_touch  [get_cells {b12_0/U1016}]
set_dont_touch  [get_cells {b12_0/U1017}]
set_dont_touch  [get_cells {b12_0/U1018}]
set_dont_touch  [get_cells {b12_0/U1019}]
set_dont_touch  [get_cells {b12_0/U1020}]
set_dont_touch  [get_cells {b12_0/U1021}]
set_dont_touch  [get_cells {b12_0/U1022}]
set_dont_touch  [get_cells {b12_0/U1023}]
set_dont_touch  [get_cells {b12_0/U1024}]
set_dont_touch  [get_cells {b12_0/U1025}]
set_dont_touch  [get_cells {b12_0/U1026}]
set_dont_touch  [get_cells {b12_0/U1027}]
set_dont_touch  [get_cells {b12_0/U1028}]
set_dont_touch  [get_cells {b12_0/U1029}]
set_dont_touch  [get_cells {b12_0/U1030}]
set_dont_touch  [get_cells {b12_0/U1031}]
set_dont_touch  [get_cells {b12_0/U1032}]
set_dont_touch  [get_cells {b12_0/U1033}]
set_dont_touch  [get_cells {b12_0/U1034}]
set_dont_touch  [get_cells {b12_0/U1035}]
set_dont_touch  [get_cells {b12_0/U1036}]
set_dont_touch  [get_cells {b12_0/U1037}]
set_dont_touch  [get_cells {b12_0/U1038}]
set_dont_touch  [get_cells {b12_0/U1039}]
set_dont_touch  [get_cells {b12_0/U1040}]
set_dont_touch  [get_cells {b12_0/U1041}]
set_dont_touch  [get_cells {b12_0/U1042}]
set_dont_touch  [get_cells {b12_0/U1043}]
