
                           Design Compiler Graphical 
                                 DC Ultra (TM)
                                  DFTMAX (TM)
                              Power Compiler (TM)
                                 DesignWare (R)
                                 DC Expert (TM)
                               Design Vision (TM)
                               HDL Compiler (TM)
                               VHDL Compiler (TM)
                                  DFT Compiler
                               Design Compiler(R)

               Version R-2020.09-SP5 for linux64 - Apr 23, 2021 

                    Copyright (c) 1988 - 2021 Synopsys, Inc.
   This software and the associated documentation are proprietary to Synopsys,
 Inc. This software may only be used in accordance with the terms and conditions
 of a written license agreement with Synopsys, Inc. All other use, reproduction,
   or distribution of this software is strictly prohibited.  Licensed Products
     communicate with Synopsys servers for the purpose of providing software
    updates, detecting software piracy and verifying that customers are using
    Licensed Products in conformity with the applicable License Key for such
  Licensed Products. Synopsys will use information gathered in connection with
    this process to deliver software updates and pursue software pirates and
                                   infringers.

 Inclusivity & Diversity - Visit SolvNetPlus to read the "Synopsys Statement on
            Inclusivity and Diversity" (Refer to article 000036315 at
                        https://solvnetplus.synopsys.com)
Initializing...
set DESIGN "control"
control
read_file -format verilog ../mul/control.v
Loading db file '/home/m108/m108061621/Desktop/TSMC_process/T90/db/slow.db'
Loading db file '/home/m108/m108061621/Desktop/TSMC_process/T90/db/fast.db'
Loading db file '/home/m108/m108061621/Desktop/TSMC_process/T90/db/typical.db'
Loading db file '/usr/cad/synopsys/synthesis/cur/libraries/syn/gtech.db'
Loading db file '/usr/cad/synopsys/synthesis/cur/libraries/syn/standard.sldb'
  Loading link library 'slow'
  Loading link library 'fast'
  Loading link library 'typical'
  Loading link library 'gtech'
Loading verilog file '/home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/mul/control.v'
Detecting input file type automatically (-rtl or -netlist).
Reading with Presto HDL Compiler (equivalent to -rtl option).
Running PRESTO HDLC
Compiling source file /home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/mul/control.v
Presto compilation completed successfully.
Current design is now '/home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/mul/control.db:control'
Loaded 1 design.
Current design is 'control'.
control
read_file -format verilog ../netlist/control_slow_syn.v
Loading verilog file '/home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/netlist/control_slow_syn.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Performing 'read' command.
Compiling source file /home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/netlist/control_slow_syn.v
Reading with netlist reader (equivalent to -netlist option).
Verilog netlist reader completed successfully.
Current design is now '/home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/netlist/control_slow_DW01_inc_0_DW01_inc_1.db:control_slow_DW01_inc_0_DW01_inc_1'
Loaded 3 designs.
Current design is 'control_slow_DW01_inc_0_DW01_inc_1'.
control_slow_DW01_inc_0_DW01_inc_1 control_slow_DW01_inc_1_DW01_inc_2 control_slow
read_file -format verilog ../netlist/control_fast_syn.v
Loading verilog file '/home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/netlist/control_fast_syn.v'
Detecting input file type automatically (-rtl or -netlist).
Running DC verilog reader
Performing 'read' command.
Compiling source file /home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/netlist/control_fast_syn.v
Reading with netlist reader (equivalent to -netlist option).
Verilog netlist reader completed successfully.
Current design is now '/home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/netlist/control_fast.db:control_fast'
Loaded 1 design.
Current design is 'control_fast'.
control_fast
current_design [get_designs $DESIGN]
Current design is 'control'.
{control}
set_operating_conditions -min fast -max slow
Using operating conditions 'slow' found in library 'slow'.
Using operating conditions 'fast' found in library 'fast'.
1
#set_dont_touch_network [get_ports *input ports name*]
set_dont_touch {"*control_slow*"}
1
set_dont_touch {"*control_fast*"}
1
# set_dont_touch {"r1"}
set_dont_touch {"u0"}
1
set_dont_touch {"u1"}
1
set_dont_touch {"u2"}
1
set_dont_touch {"u3"}
1
set_dont_touch {"u4"}
1
# set_dont_touch {"*u5*"}
# set_dont_touch {"*u6*"}
# set_dont_touch {"*u7*"}
# set_dont_touch {"*u8*"}
# set_dont_touch {"*u9*"}
#set_dont_touch {"*instance name*"}
#set_dont_touch {"s*/n*"}
create_clock -period 10 [get_ports clk]
1
link

  Linking design 'control'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  slow (library)              /home/m108/m108061621/Desktop/TSMC_process/T90/db/slow.db
  fast (library)              /home/m108/m108061621/Desktop/TSMC_process/T90/db/fast.db
  typical (library)           /home/m108/m108061621/Desktop/TSMC_process/T90/db/typical.db

1
check_design
1
uniquify
1
set_fix_multiple_port_nets -all -buffer_constants
1
#set compile_new_boolean_structure
#set_structure false
compile -map_effort medium
Information: Evaluating DesignWare library utilization. (UISN-27)

============================================================================
| DesignWare Building Block Library  |         Version         | Available |
============================================================================
| Basic DW Building Blocks           | R-2020.09-DWBB_202009.5 |     *     |
| Licensed DW Building Blocks        |                         |           |
============================================================================



  Beginning Pass 1 Mapping
  ------------------------
  Processing 'control'

  Updating timing information
Information: Updating design information... (UID-85)

  Beginning Mapping Optimizations  (Medium effort)
  -------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:02    1634.9      0.00       0.0       0.0                          
    0:00:02    1634.9      0.00       0.0       0.0                          
    0:00:02    1634.9      0.00       0.0       0.0                          
    0:00:02    1634.9      0.00       0.0       0.0                          
    0:00:02    1634.9      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          



  Beginning Delay Optimization Phase
  ----------------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          


  Beginning Area-Recovery Phase  (cleanup)
  -----------------------------

                                  TOTAL                                      
   ELAPSED            WORST NEG   SETUP    DESIGN                            
    TIME      AREA      SLACK     COST    RULE COST         ENDPOINT         
  --------- --------- --------- --------- --------- -------------------------
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
    0:00:02    1633.5      0.00       0.0       0.0                          
Loading db file '/home/m108/m108061621/Desktop/TSMC_process/T90/db/slow.db'
Loading db file '/home/m108/m108061621/Desktop/TSMC_process/T90/db/fast.db'
Loading db file '/home/m108/m108061621/Desktop/TSMC_process/T90/db/typical.db'


Note: Symbol # after min delay cost means estimated hold TNS across all active scenarios 


  Optimization Complete
  ---------------------
1
set bus_inference_style {%s[%d]}
%s[%d]
set bus_naming_stule {%s[%d]}
%s[%d]
set hdlout_internal_busses true
true
change_names -hierarchy -rule verilog
Warning: The specified replacement character (_) is conflicting with the specified allowed or restricted character.   (UCN-4)
1
define_name_rules name_rule -allowed {a-z A-Z 0-9 _} -max_length 255 -type cell
1
define_name_rules name_rule -allowed {a-z A-Z 0-9 _} -max_length 255 -type net
1
define_name_rules name_rule -map {{"\*cell\*", "cell"}}
1
define_name_rules name_rule -map {{"\*-return\*", "myreturn"}}
1
define_name_rules name_rule -case_insensitive
1
change_names -hierarchy -rules name_rule
1
set verilogout_show_unconnected_pins true
true
report_area -hierarchy > ./rpt/$DESIGN\_syn_area.arp
report_power > ./rpt/$DESIGN\_syn_power.prp
report_reference > ./rpt/$DESIGN\_syn_reference
report_timing -path full -delay max > ./rpt/$DESIGN\_syn_timing.trp
write -format verilog -hierarchy -output ../netlist/$DESIGN\_syn.v
Writing verilog file '/home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/netlist/control_syn.v'.
1
write_sdf -version 1.0 -context verilog -load_delay cell ../netlist/$DESIGN\_syn.sdf
Information: Writing timing information to file '/home/m108/m108061621/Desktop/Research/BISG_my/b12_adpll_clk/netlist/control_syn.sdf'. (WT-3)
1
write_sdc ../netlist/$DESIGN\_syn.sdc
1
exit

Memory usage for this session 232 Mbytes.
Memory usage for this session including child processes 232 Mbytes.
CPU usage for this session 8 seconds ( 0.00 hours ).
Elapsed time for this session 352 seconds ( 0.10 hours ).

Thank you...
